app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("is_confirmed", "is_paid", "firm_id", "lawyer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["is_confirmed", false], ["is_paid", false], ["firm_id", 1], ["lawyer_id", 1], ["created_at", "2022-03-30 13:00:42.864238"], ["updated_at", "2022-03-30 13:00:42.864238"]]
---
    def create
        @appointment = Appointment.new(post_params)
        if @appointment.save

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1005], ["LIMIT", 1]]
UPDATE "appointments" SET "is_confirmed" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["is_confirmed", true], ["updated_at", "2022-03-30 10:04:07.034229"], ["id", 1005]]
UPDATE "appointments" SET "client_id" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["client_id", 13], ["updated_at", "2022-03-30 10:15:31.668201"], ["id", 983]]
---
    def update
        @appointment = Appointment.find(params[:id].to_i)
        @appointment.update(is_confirmed: !@appointment.is_confirmed)
        if @appointment.client_id == nil
            @appointment.update(client_id: current_user.id)